{"data":{"site":{"siteMetadata":{"title":"jordnjones.com","author":"@Pr0x1m4"}},"markdownRemark":{"id":"ef747a4c-8d9f-599a-94cc-9cfe104ce0d4","excerpt":"Typo is a lightweight, portable font viewer built with  Electron , React  and  Redux I've been tinkering with this project for some time but since recently I…","html":"<p>Typo is a lightweight, portable font viewer built with <b>Electron</b>,<b>React</b> and <b>Redux</b></p>\n<p>I've been tinkering with this project for some time but since recently I decided to put some more time and effort behind it, in an effort to create better tools for viewing and possibly in the future editing fonts.</p>\n<img src=\"https://i.imgur.com/4Tso6Xk.gif\" style=\"max-width: 100%; max-height:100%\" >\n<p style=\"font-size:11px\">Typo in action</p>\n<h3>Background</h3>\n<p>Inspiration for Typo came from a web app that used OpenType.js to load fonts to the browser, <a href=\"https://bluejamesbond.github.io/CharacterMap/\">Character Map</a>. Initial versions of Typo were based heavily on this, so credits to <a href=\"https://github.com/bluejamesbond\">bluejamesbond</a> for amazing work.</p>\n<img src=\"https://i.imgur.com/SXdA77Q.png\" style=\"max-width: 100%; max-height:100%\">\n<p style=\"font-size:11px\">Original Character Map: <a href=\"https://bluejamesbond.github.io/CharacterMap/\">https://bluejamesbond.github.io/CharacterMap/</a></p>\n<h3>Changes</h3>\n<p>The initial version of Typo used and relied solely on React for state and structure, I soon quickly ran into state related errors and hacky work arounds that affected performance, thus verison 2 of Typo has re-written with Redux.</p>\n<p>Developing with redux has been a really fun experience, once I learnt to \"think\" in Redux features were easier to implement and maintain and just generally move around with breaking the overall project.</p>\n<h3>Challenges</h3>\n<p>One of the most difficult challenges I faced while developing Typo was adapting the Redux's model and the various add-ons/functions that existed within the ecosystem of Redux (react-redux, connect(), mapStateToProps, MapDispatchToProps).</p>\n<p>Aside from this initial learning curve, once I <em>finally</em> understood them, it was like developing with a jetpack strapped to my back.</p>\n<p>Typo is now available for download (via <a href=\"https://github.com/Pr0x1m4/typo\">github</a>), I'll make a website(eventually lol).</p>","frontmatter":{"title":"Typo, an expirement in font viewing","date":"November 05, 2017"}}},"pageContext":{"slug":"/11-05-2017-Typo-Version-2/","previous":{"fields":{"slug":"/09-21-2017-Lurk/"},"frontmatter":{"title":"Lurk, a new way to browse Twitter"}},"next":{"fields":{"slug":"/12-17-2017-Cxfree/"},"frontmatter":{"title":"Cxfree, free Caribbean exam past papers"}}}}